---
kind: enumMember
id: F:Autodesk.Revit.DB.PointOnCurveMeasurementType.ChordLength
enum: Autodesk.Revit.DB.PointOnCurveMeasurementType
source: html/8bd00c68-1bcd-9bc9-c246-0f0c96962146.htm
---
# Autodesk.Revit.DB.PointOnCurveMeasurementType.ChordLength

Chord length = length of the chord (line segment) joining the start point and the given point.
 Also known as 3D distance